In [ ]:
import pandas as pd

In [11]:

custom = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

custom

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [9]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [6]:
#Create a series
ages = pd.Series([22, 35, 58], name="Age")
ages

0    22
1    35
2    58
Name: Age, dtype: int64

In [7]:
df["Age"].max()
ages.max()

58

In [39]:
titanic = pd.read_csv("historical_charges_details.csv")

titanic

,Customer Name,Job ID,Invoice Date,Due Date,Previous Balance,Payments,Previous Unpaid Balance,Current Charges,kWh,kWh Rate,Non-ACH AutoPay Adjustment,Tax,Total Amount due
0,Mahesh Goud Thorupunoori,JB-2102067-00,03/06/2022,04/05/2022,$32.980000,$32.980000,$0.000000,$49.480000,389.58,0.1270,$0.000000,$0.000000,$49.480000
1,Mahesh Goud Thorupunoori,JB-2102067-00,02/06/2022,03/05/2022,$33.410000,$33.410000,$0.000000,$32.980000,259.66,0.1270,$0.000000,$0.000000,$32.980000
2,Mahesh Goud Thorupunoori,JB-2102067-00,01/06/2022,02/05/2022,$46.490000,$46.490000,$0.000000,$33.410000,263.10,0.1270,$0.000000,$0.000000,$33.410000
3,Mahesh Goud Thorupunoori,JB-2102067-00,12/06/2021,01/05/2022,$48.680000,$48.680000,$0.000000,$46.490000,376.76,0.1234,$0.000000,$0.000000,$46.490000
4,Mahesh Goud Thorupunoori,JB-2102067-00,11/06/2021,12/05/2021,$52.710000,$52.710000,$0.000000,$48.680000,394.47,0.1234,$0.000000,$0.000000,$48.680000
5,Mahesh Goud Thorupunoori,JB-2102067-00,10/06/2021,11/05/2021,$0.000000,$0.000000,$0.000000,$68.940000,558.71,0.1234,$0.000000,$0.000000,$52.710000
6,Mahesh Goud Thorupunoori,JB-2102067-00,09/06/2021,10/05/2021,$0.000000,$0.000000,$0.000000,$75.450000,611.44,0.1234,$0.000000,$0.000000,$0.000000
7,Mahesh Goud Thorupunoori,JB-2102067-00,08/06/2021,09/05/2021,$90.910000,$90.910000,$0.000000,$0.000000,-742.96,0.1234,$0.000000,$0.000000,$0.000000
8,Mahesh Goud Thorupunoori,JB-2102067-00,07/06/2021,08/05/2021,$31.870000,$31.870000,$0.000000,$90.910000,736.72,0.1234,$0.000000,$0.000000,$90.910000
9,Mahesh Goud Thorupunoori,JB-2102067-00,06/06/2021,07/05/2021,$20.640000,$20.640000,$0.000000,$31.870000,258.25,0.1234,$0.000000,$0.000000,$31.870000
10,Mahesh Goud Thorupunoori,JB-2102067-00,05/06/2021,06/05/2021,$71.110000,$71.110000,$0.000000,$20.640000,167.23,0.1234,$0.000000,$0.000000,$20.640000
11,Mahesh Goud Thorupunoori,JB-2102067-00,04/11/2021,05/05/2021,$178.520000,$178.520000,$0.000000,$71.110000,576.28,0.1234,$0.000000,$0.000000,$71.110000
12,Mahesh Goud Thorupunoori,JB-2102067-00,03/03/2021,04/10/2021,$140.480000,$0,$140.480000,$38.040000,247.52,0.1234,$7.500000,$0.000000,$178.520000
13,Mahesh Goud Thorupunoori,JB-2102067-00,02/03/2021,03/01/2021,$0,$0,$0,$140.480000,1077.60,0.1234,$7.500000,$0.000000,$140.480000

In [40]:
titanic.head(2)

,Customer Name,Job ID,Invoice Date,Due Date,Previous Balance,Payments,Previous Unpaid Balance,Current Charges,kWh,kWh Rate,Non-ACH AutoPay Adjustment,Tax,Total Amount due
0,Mahesh Goud Thorupunoori,JB-2102067-00,03/06/2022,04/05/2022,$32.980000,$32.980000,$0.000000,$49.480000,389.58,0.127,$0.000000,$0.000000,$49.480000
1,Mahesh Goud Thorupunoori,JB-2102067-00,02/06/2022,03/05/2022,$33.410000,$33.410000,$0.000000,$32.980000,259.66,0.127,$0.000000,$0.000000,$32.980000

In [41]:
titanic.tail(2)

,Customer Name,Job ID,Invoice Date,Due Date,Previous Balance,Payments,Previous Unpaid Balance,Current Charges,kWh,kWh Rate,Non-ACH AutoPay Adjustment,Tax,Total Amount due
12,Mahesh Goud Thorupunoori,JB-2102067-00,03/03/2021,04/10/2021,$140.480000,$0,$140.480000,$38.040000,247.52,0.1234,$7.500000,$0.000000,$178.520000
13,Mahesh Goud Thorupunoori,JB-2102067-00,02/03/2021,03/01/2021,$0,$0,$0,$140.480000,1077.60,0.1234,$7.500000,$0.000000,$140.480000

In [43]:
titanic.dtypes

Customer Name                  object
Job ID                         object
Invoice Date                   object
Due Date                       object
Previous Balance               object
Payments                       object
Previous Unpaid Balance        object
Current Charges                object
kWh                           float64
kWh Rate                      float64
Non-ACH AutoPay Adjustment     object
Tax                            object
Total Amount due               object
dtype: object

In [52]:
df1 = pd.DataFrame([['a', 'b'], ['c', 'd']],
                   index=['row 1', 'row 2'],
                   columns=['col 1', 'col 2'])
df1
#.to_excel("output.xlsx")

      col 1 col 2
row 1     a     b
row 2     c     d

In [78]:
df = pd.read_csv('titanic.csv')
#df_XLSX = pd.read_excel('titanic.xlsx')
#df_txt = pd.read_csv('titanic.csv', delimeter='\t')
df
#print(titanic.head(3))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [147]:
#Read Headers

print(df.columns)

df
##Read each column

#df[['PassengerId', 'Pclass']] [0:5]

##Read each row
df.iloc[0:4]


##Read a specific loaction (R,C)
#df.iloc[2,3]

#for index, row in df.iterrows():
   # print(index,row['Name'])
    
df.loc[df['Cabin'] == "NaN"]

df.describe()
df.sort_values('Name', ascending = False)

df.sort_values(['Name', 'Ticket'], ascending = True)

df.sort_values(['Name', 'Ticket'], ascending = [1,0])

Index(['PassengerId', 'Survived', 'Pclass', 'Total', 'SibSp', 'Fare', 'Cabin',
       'Cabin', 'Cabin', 'Cabin',
       ...
       'Cabin', 'Cabin', 'Cabin', 'Cabin', 'Cabin', 'Cabin', 'Cabin', 'Cabin',
       'Cabin', 'Cabin'],
      dtype='object', length=102)

<class 'ValueError'>: Cannot index with multidimensional key

In [145]:
#df['Total'] = df['SibSp'] + df['Parch']+ df['Fare']

#df = df.drop(columns = ['Total'])

# all columns
df['Total'] = df.iloc[:, 5:8].sum(axis=1)

cols = list(df.columns)

df = df[cols[0:4] + [cols[-1]] + cols[4:11]]

#df[['Name', 'sex', 'Ticket', 'Total']]


df.head(5)

,PassengerId,Survived,Pclass,Total,SibSp,Fare,Cabin,Cabin,Cabin,Cabin,...,Cabin,Cabin,Cabin,Cabin,Cabin,Cabin,Cabin,Cabin,Cabin,Cabin
0,1,0,3,0,1,7.2500,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,1,1,C85C85C85,1,71.2833,C85,C85,C85,C85,...,C85,C85,C85,C85,C85,C85,C85,C85,C85,C85
2,3,1,3,0,0,7.9250,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,1,1,C123C123C123,1,53.1000,C123,C123,C123,C123,...,C123,C123,C123,C123,C123,C123,C123,C123,C123,C123
4,5,0,3,0,0,8.0500,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [146]:
df

,PassengerId,Survived,Pclass,Total,SibSp,Fare,Cabin,Cabin,Cabin,Cabin,...,Cabin,Cabin,Cabin,Cabin,Cabin,Cabin,Cabin,Cabin,Cabin,Cabin
0,1,0,3,0,1,7.2500,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,1,1,C85C85C85,1,71.2833,C85,C85,C85,C85,...,C85,C85,C85,C85,C85,C85,C85,C85,C85,C85
2,3,1,3,0,0,7.9250,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,1,1,C123C123C123,1,53.1000,C123,C123,C123,C123,...,C123,C123,C123,C123,C123,C123,C123,C123,C123,C123
4,5,0,3,0,0,8.0500,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,0,0,13.0000,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
887,888,1,1,B42B42B42,0,30.0000,B42,B42,B42,B42,...,B42,B42,B42,B42,B42,B42,B42,B42,B42,B42
888,889,0,3,0,1,23.4500,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
889,890,1,1,C148C148C148,0,30.0000,C148,C148,C148,C148,...,C148,C148,C148,C148,C148,C148,C148,C148,C148,C148
890,891,0,3,0,0,7.7500,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [125]:
#df.to_csv('modified.csv', index = False)

#df.to_excel('modified1.xlsx',  index= False)

df.to_csv('modified.txt', index = False, sep = '\t')

In [140]:
new_df = df.loc[(df['Sex'] == 'male') & (df['Parch'] == 0) & (df['Age'] > 27) ]

#new_df.to_csv('Filtered.csv')

#new_df = new_df.reset_index( drop = True)

new_df.reset_index( drop = True, inplace = True)

new_df

,PassengerId,Survived,Pclass,Total,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
0,5,0,3,35.0,male,35.0,0,0,373450,8.0500,NaN
1,7,0,1,54.0,male,54.0,0,0,17463,51.8625,E46
2,21,0,2,35.0,male,35.0,0,0,239865,26.0000,NaN
3,22,1,2,34.0,male,34.0,0,0,248698,13.0000,D56
4,24,1,1,28.0,male,28.0,0,0,113788,35.5000,A6
...,...,...,...,...,...,...,...,...,...,...,...
214,873,0,1,33.0,male,33.0,0,0,695,5.0000,B51 B53 B55
215,874,0,3,47.0,male,47.0,0,0,345765,9.0000,NaN
216,882,0,3,33.0,male,33.0,0,0,349257,7.8958,NaN
217,884,0,2,28.0,male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN
218,891,0,3,32.0,male,32.0,0,0,370376,7.7500,NaN

In [141]:
df.loc[df['Name'].str.contains('de')]

<class 'KeyError'>: 'Name'

In [ ]:
#working on large dataset

new_df = pd.DataFrame(columns=df.columns)

for df in pd.read_csv('file.csv', chunksize=10):
    results = df.groupby(['Type 1']).count()
    
    new_df = pd.concat([new_df, results])